# Import Libraries

In [1]:
import numpy as np
import pandas as pd

# Pivot

In [3]:
df_sales_long = pd.DataFrame({
    'date':['2024-01-01', '2024-01-01', '2024-01-01','2024-01-02', '2024-01-02', '2024-01-02','2024-01-03', '2024-01-03', '2024-01-03']
    ,'product' : ['Laptop', 'Mouse', 'Keyboard','Laptop', 'Mouse', 'Keyboard','Laptop', 'Mouse', 'Keyboard']
    ,'sales' : [1200, 25, 75, 1500, 30, 80, 1100, 20, 70]
    ,'quantity' : [2, 5, 3, 3, 6, 4, 2, 4, 3]
})

display(df_sales_long)

         date   product  sales  quantity
0  2024-01-01    Laptop   1200         2
1  2024-01-01     Mouse     25         5
2  2024-01-01  Keyboard     75         3
3  2024-01-02    Laptop   1500         3
4  2024-01-02     Mouse     30         6
5  2024-01-02  Keyboard     80         4
6  2024-01-03    Laptop   1100         2
7  2024-01-03     Mouse     20         4
8  2024-01-03  Keyboard     70         3

In [ ]:
df_sales_long.pivot(index='date', columns='product', values='sales')

product     Keyboard  Laptop  Mouse
date
2024-01-01        75    1200     25
2024-01-02        80    1500     30
2024-01-03        70    1100     20

In [14]:
df_sales_long.pivot_table(values='sales',index='date',columns='product',aggfunc='mean')

product     Keyboard  Laptop  Mouse
date
2024-01-01      75.0  1200.0   25.0
2024-01-02      80.0  1500.0   30.0
2024-01-03      70.0  1100.0   20.0

# Melt

In [16]:
sales_wide = pd.DataFrame({
      'date': ['2024-01-01', '2024-01-02', '2024-01-03'],
      'Laptop': [1200, 1500, 1100],
      'Mouse': [25, 30, 20],
      'Keyboard': [75, 80, 70]
  })
sales_wide.head()

         date  Laptop  Mouse  Keyboard
0  2024-01-01    1200     25        75
1  2024-01-02    1500     30        80
2  2024-01-03    1100     20        70

In [21]:
pd.melt(sales_wide, id_vars=['date'], value_vars=['Laptop', 'Mouse', 'Keyboard'], var_name='product', value_name='sales')

         date   product  sales
0  2024-01-01    Laptop   1200
1  2024-01-02    Laptop   1500
2  2024-01-03    Laptop   1100
3  2024-01-01     Mouse     25
4  2024-01-02     Mouse     30
5  2024-01-03     Mouse     20
6  2024-01-01  Keyboard     75
7  2024-01-02  Keyboard     80
8  2024-01-03  Keyboard     70

# Stack Unstack

In [23]:
scores = pd.DataFrame({
      'Math': [90, 85, 92],
      'Science': [88, 90, 85],
      'English': [85, 88, 90]
  }, index=['Student A', 'Student B', 'Student C'])

scores.head()

           Math  Science  English
Student A    90       88       85
Student B    85       90       88
Student C    92       85       90

In [24]:
scores.T

         Student A  Student B  Student C
Math            90         85         92
Science         88         90         85
English         85         88         90

# Advanced Pivot with Aggregation

In [26]:
sales_detailed = pd.DataFrame({
      'date': ['2024-01-01', '2024-01-01', '2024-01-02', '2024-01-02',
               '2024-01-01', '2024-01-02'],
      'region': ['North', 'South', 'North', 'South', 'North', 'South'],
      'product': ['Laptop', 'Laptop', 'Mouse', 'Mouse', 'Keyboard', 'Keyboard'],
      'sales': [1200, 1300, 25, 30, 75, 80],
      'quantity': [2, 2, 5, 6, 3, 4]
  })

sales_detailed.head()

         date region   product  sales  quantity
0  2024-01-01  North    Laptop   1200         2
1  2024-01-01  South    Laptop   1300         2
2  2024-01-02  North     Mouse     25         5
3  2024-01-02  South     Mouse     30         6
4  2024-01-01  North  Keyboard     75         3

In [32]:
sales_detailed.pivot_table(index=['date'], aggfunc='sum', values=['sales'], columns='product')

              sales
product    Keyboard  Laptop Mouse
date
2024-01-01     75.0  2500.0   NaN
2024-01-02     80.0     NaN  55.0

In [33]:
sales_detailed.pivot_table(index=['region'], aggfunc='mean', values=['sales'], columns='product')

           sales
product Keyboard  Laptop Mouse
region
North       75.0  1200.0  25.0
South       80.0  1300.0  30.0